{"url": "https://baltimore.cbslocal.com/2020/04/25/pylesville-helicopter-crash-latest/", "fetchtime": "2020-04-26T03:49:16+00:00", "keywords": ["maryland state police", " helicopter crash", ""], "language": "en-US", "firstpubtime": "2020-04-25T19:29:01+00:00", "modtime": "2020-04-25T19:29:01+00:00", "headline": "Helicopter Crashes Near Pylesville; No Major Injuries Reported, State Police Say", "bylines": ["CBS Baltimore"], "source": "CBS Baltimore", "summary": "No major injuries have been reported after a helicopter crashed in Pylesville on Saturday.", "originalurl": "https://baltimore.cbslocal.com/2020/04/25/pylesville-helicopter-crash-latest/", "previousfetches": 0, "bodytext": "PYLESVILLE, Md. (WJZ) —  No major injuries have been reported after a helicopter crashed in Pylesville on Saturday.   The crash happened around 1 p.m. in the 4400 block of Graceton Road. Officials had earlier given an address of Route 624 near Wheeler School Road.   The helicopter, a Hughes 369D, went down while the pilot, Andrew Rannigan, 34, of Chesapeake, Virginia, was inspecting power lines, Maryland State Police said.   Rannigan, who was the only person in the helicopter at the time, declined medical attention. Police initially said he was not injured but later said he suffered a minor injury.     Troopers on scene of helicopter crash near Pylesville report aircraft is a Hughes 369D.  It went down while the pilot, who was the only occupant, was inspecting power lines. No injuries reported.   — MD State Police (@MDSP)  April 25, 2020     The cause of the crash is unknown. The FAA is investigating, police said.                                 ", "sentiment": -0.022489316239316246, "subjectivity": 0.39829059829059826, "wordcount": 151}
{"url": "https://baltimore.cbslocal.com/2020/04/25/nfl-draft-steelers-pick-up-terps-anthony-mcfarland-antoine-brooks/", "fetchtime": "2020-04-26T03:49:17+00:00", "keywords": ["nfl draft", " 2020 nfl draft", " draft", " nfl", " anthony mcfarland jr.", " antoine brooks jr.", " pittsburgh steelers", " steelers"], "language": "en-US", "firstpubtime": "2020-04-25T22:09:50+00:00", "modtime": "2020-04-25T22:09:50+00:00", "headline": "NFL Draft: Steelers Pick Up Terps RB Anthony McFarland Jr., S Antoine Brooks Jr.", "bylines": ["CBS Baltimore"], "source": "CBS Baltimore", "summary": "Maryland running back Anthony McFarland, Jr., and safety Antoine Brooks, Jr., are heading north.", "originalurl": "https://baltimore.cbslocal.com/2020/04/25/nfl-draft-steelers-pick-up-terps-anthony-mcfarland-antoine-brooks/", "previousfetches": 0, "bodytext": "PITTSBURGH (WJZ) —  Maryland running back Anthony McFarland, Jr., and safety Antoine Brooks, Jr., are heading north.   The Pittsburgh Steelers drafted both Terps during the 2020 NFL Draft on Saturday.   McFarland was picked during the fourth round and was the 124th overall pick in the draft.     With the 124th pick in the  #NFLDraft , we select RB Anthony McFarland Jr.  #SteelersDraft   pic.twitter.com/M0Z84X20J3   — Pittsburgh Steelers (@steelers)  April 25, 2020     Brooks got picked 198th overall during the sixth round.   The Terps tweeted their congratulations to Brooks Saturday evening:   “Two-star recruit  “Career almost cut short due to injury   “Nothing stopped him. Watch the moment  “@TwanDoee’s NFL dreams came true.”         Two-star recruit Career almost cut short due to injury   Nothing stopped him. Watch the moment  @TwanDoee 's NFL dreams came true.  pic.twitter.com/T9F41cuher   — Maryland Football (@TerpsFootball)  April 25, 2020                                   ", "sentiment": 0.004166666666666661, "subjectivity": 0.2875, "wordcount": 136}
{"url": "https://baltimore.cbslocal.com/2020/04/25/coronavirus-creates-unprecedented-maryland-congressional-election/", "fetchtime": "2020-04-26T03:49:18+00:00", "keywords": ["coronavirus", " covid-19", " maryland 7th congressional district", " special election", " kweisi mfume", " kimberly klacik", " kim klacik"], "language": "en-US", "firstpubtime": "2020-04-25T16:07:23+00:00", "modtime": "2020-04-25T16:07:23+00:00", "headline": "Coronavirus Creates Unprecedented Maryland Congressional Election", "bylines": ["CBS Baltimore"], "source": "CBS Baltimore", "summary": "Ballots cast in person in Maryland's special congressional election between Democrat Kweisi Mfume and Republican Kimberly Klacik will be quarantined for about 24 hours after poll close before being counted — to give any potential germs a chance to die to help protect election workers.", "originalurl": "https://baltimore.cbslocal.com/2020/04/25/coronavirus-creates-unprecedented-maryland-congressional-election/", "previousfetches": 0, "bodytext": "  ANNAPOLIS, Md. (AP) —  Ballots cast in person in Maryland’s special congressional election between Democrat Kweisi Mfume and Republican Kimberly Klacik will be quarantined for about 24 hours after poll close before being counted — to give any potential germs a chance to die to help protect election workers.  It’s one of the safety measures that’s being taken in an unprecedented Maryland election on Tuesday that will only have three places for in-person voting out of concern for the coronavirus, as election officials are strongly urging eligible voters to mail in their ballots in a single race to decide who will serve the rest of the term of the late U.S. Rep. Elijah Cummings,  who died in October .   In hopes of avoiding the lines seen in this month’s Wisconsin primary, roughly 484,000 ballots were mailed to registered voters in the district. More than 77,000 already have been turned in. More than half of the vote could be released on the state elections board website shortly after the 8 p.m. poll close on Tuesday.   Precautions due to the virus in this special election have thrust the candidates into unknown campaign territory in the time of a pandemic.   Fundraising has been tough. Candidates haven’t been able to reach voters with traditional techniques like door-to-door campaigning or large events. Both candidates say they have been trying to reach voters more through social media.   The majority-black district that includes a large portion of Baltimore as well as parts of its suburbs in Baltimore and Howard counties is heavily Democratic, with more than four Democrats for each Republican.   Klacik, the Republican who has appeared on Fox News and caught President Donald Trump’s attention with her social media posts that prompted the president to describe the district as a “ disgusting rat and rodent infested mess ,” said the pandemic has made it difficult to campaign. But the 38-year-old believes she has an edge on the 71-year-old Mfume in the realm of social media.   “I don’t think he was really on social media platforms previously, so I felt like we had a little bit of an advantage that way, but, at the same time, he has such a big name,” Klacik said. “So, we’re basically trying to shout out loud on social media how we can make a positive impact against basically an incumbent, because he had the seat prior to Congressman Cummings.”   Mfume, a former NAACP head who held the U.S. House seat for five terms from 1987 to 1996, said he also has been working hard on social media. The man who won his first race for Baltimore City Council in 1978 by three votes said he’s not taking anything for granted in the uncertain times.   “It probably concerns me more, because I recognize how elections can be close — even when you don’t think that they are going to be,” Mfume said.   Some of the leading issues both candidates have been campaigning on include health care, reducing crime and promoting job creation.   Mfume supports stronger gun-control measures and focusing on root causes of crime, like the inability of young adults to find jobs. He has been advocating for greater support for apprenticeships to develop skills for young people to find work.   Klacik has been advocating to help struggling parts of Baltimore through a federal program known as opportunity zones. The program, which is supported by Trump, focuses on increasing private investment in distressed communities with tax incentives for people who invest in real estate projects and operate businesses in designated low-income communities.   Only three in-person voting centers will be open Tuesday for voters who can’t vote by mail, such as the disabled or the homeless, though other eligible voters can cast ballots in person if they choose.   Voting centers are being prepared to comply with social distancing guidelines.   “Things will be very spread apart,” said Nikki Charlson, the state election board’s deputy administrator. “The poll workers will be sanitizing the surfaces.”   The winner will run as an incumbent in the state’s crowded June 2 primary for a full term. Ballots for the primary will be mailed to Maryland voters in early to mid-May, very soon after Tuesday’s election.   “That just seems a little strange and foreign. It’s because it really is,” Mfume said. “We’ve never had anything like this in the state before.”   (© Copyright 2020 The Associated Press. All Rights Reserved. This material may not be published, broadcast, rewritten or redistributed.)                                 ", "sentiment": 0.07085574358301631, "subjectivity": 0.4291879837334383, "wordcount": 740}
{"url": "https://baltimore.cbslocal.com/2020/04/25/police-involved-shooting-northeast-baltimore-latest/", "fetchtime": "2020-04-26T03:49:18+00:00", "keywords": ["police-involved shooting", " shooting", " baltimore"], "language": "en-US", "firstpubtime": "2020-04-25T22:44:12+00:00", "modtime": "2020-04-25T22:44:12+00:00", "headline": "Police-Involved Shooting Reported In NE Baltimore; No Officers Injured", "bylines": ["CBS Baltimore"], "source": "CBS Baltimore", "summary": "One person was injured in a police-involved shooting in northeast Baltimore Saturday afternoon, officials said.", "originalurl": "https://baltimore.cbslocal.com/2020/04/25/police-involved-shooting-northeast-baltimore-latest/", "previousfetches": 0, "bodytext": "BALTIMORE (WJZ) —  One person was injured in a police-involved shooting in northeast Baltimore Saturday afternoon, officials said.   The Baltimore Police Department said the shooting happened in the 3900 block of Erdman Avenue. Two officers were on patrol in the area around 4:50 p.m. when they saw some kind of incident happening at the intersection of Erdman and Bonview avenues, Police Commissioner Michael Harrison said.   “The officers exited their vehicle and approached what they thought they believed was the subject standing in front of 3916 armed with a handgun,” Harrison said.     At least one officer discharged a firearm, the commissioner said. It’s unclear how many rounds were fired.   One person — presumed to be the suspect — was struck in the arm. The gun the suspect was carrying is believed to be a replica, Harrison said.   The suspect is reportedly in stable condition.   The city’s police union reports no officers were injured.   The incident is under investigation.                                 ", "sentiment": 0.15833333333333333, "subjectivity": 0.5333333333333333, "wordcount": 157}
{"url": "https://baltimore.cbslocal.com/2020/04/25/baltimore-county-to-pay-5-4m-to-settle-age-discrimination-suit/", "fetchtime": "2020-04-26T03:49:18+00:00", "keywords": ["baltimore county", " eeoc", " equal employment opportunity commission", " age discrimination", " lawsuit"], "language": "en-US", "firstpubtime": "2020-04-25T22:32:00+00:00", "modtime": "2020-04-25T22:32:00+00:00", "headline": "Baltimore County To Pay $5.4M To Settle Age Discrimination Suit", "bylines": ["CBS Baltimore"], "source": "CBS Baltimore", "summary": "Baltimore County will pay more than $5 million to settle a 13-year-old age discrimination lawsuit brought by the U.S. Equal Employment Opportunity Commission, the agency said Friday.", "originalurl": "https://baltimore.cbslocal.com/2020/04/25/baltimore-county-to-pay-5-4m-to-settle-age-discrimination-suit/", "previousfetches": 0, "bodytext": "BALTIMORE (WJZ) —  Baltimore County will pay more than $5 million to settle a 13-year-old age discrimination lawsuit brought by the U.S. Equal Employment Opportunity Commission, the agency said Friday.   Under a consent order, the county will pay $5.4 million to more than 2,000 retirees who paid higher pension contributions based on their age, the EEOC said.   That provision has since been found to violate the Age Discrimination in Employment Act.   Two correctional officers in the county first filed a complaint with the EEOC in 2007. The agency said the employees had first tried to settle with the county.                                 ", "sentiment": 0.20714285714285713, "subjectivity": 0.37380952380952387, "wordcount": 99}
{"url": "https://baltimore.cbslocal.com/2020/04/25/nfl-draft-miami-dolphins-draft-navy-qb-malcolm-perry/", "fetchtime": "2020-04-26T03:49:18+00:00", "keywords": ["nfl draft", " nfl", " draft", " 2020 nfl draft", " malcolm perry", " navy", " navy football"], "language": "en-US", "firstpubtime": "2020-04-25T22:40:19+00:00", "modtime": "2020-04-25T22:40:19+00:00", "headline": "NFL Draft: Miami Dolphins Draft Navy QB Malcolm Perry", "bylines": ["CBS Baltimore"], "source": "CBS Baltimore", "summary": "The Miami Dolphins drafted Navy quarterback Malcolm Perry in the seventh round of the 2020 NFL Draft on Saturday.", "originalurl": "https://baltimore.cbslocal.com/2020/04/25/nfl-draft-miami-dolphins-draft-navy-qb-malcolm-perry/", "previousfetches": 0, "bodytext": "  MIAMI (WJZ) —  The Miami Dolphins drafted Navy quarterback Malcolm Perry in the seventh round of the 2020 NFL Draft on Saturday.  Perry was the 246th overall pick in the draft. A Naval Academy spokesperson said Perry is expected to play wide receiver and running back for the Dolphins.     From Annapolis to Miami! Malcolm Perry selected by the  @MiamiDolphins . #NavyFB  |  #BuiltDifferent   pic.twitter.com/pkrOIOUwD2   — Navy Football (@NavyFB)  April 25, 2020     “I’m super excited for Malcolm, he’s so deserving of this opportunity,” head football coach Ken Niumatalolo said in a news release. “Malcolm has always put the team before himself and I’m so happy that he is getting some individual recognition for his incredible career.”   MORE NFL DRAFT NEWS:     Viviano: Ravens’ 2020 NFL Draft Class ‘Packed With Potential’   NFL Draft: Ravens Pick Up S Geno Stone In 7th Round, WR James Proche In 6th Round   NFL Draft: Ravens Bolster Defensive Line, Take Broderick Washington Jr. In Fifth Round   NFL Draft: Ravens Take Offensive Guard Ben Bredeson In Fourth Round Of Draft   NFL Draft: Ravens 3rd Round Picks Include Justin Madubuike, Devin Duvernary, Malik Harrison, Tyre Phillips   NFL Draft: Ravens Pick Up J.K. Dobbins In Second Round Of 2020 Draft   Ravens Could Target Interior Offensive Lineman In Coming Rounds Of Draft   Ravens First Round Pick Patrick Queen Ready For ‘A Lot Of Wins’ In Rookie Season   Lamar Jackson Calls Ravens 1st Round Pick Patrick Queen ‘Ray Lewis Jr.’   Ravens Take LB Patrick Queen With 28th Overall Pick In 2020 NFL Draft   Baltimore Ravens To Raise Money For The Salvation Army During NFL Draft   ‘We Love To Make Trades’ | Ravens General Manager Eric DeCosta Previews NFL Draft   Former Towson University QB Tom Flacco Hopes To Hear His Name Called At The NFL Draft   Interior Offensive Line And Inside Linebacker Are Ravens Clear Needs In NFL Draft Says WJZ’s Mark Viviano   Read More NFL News From CBSSports.com     Perry said he’s excited to get to work in Florida.   “I saw a Florida number pop up and I was a little surprised,” he said in a statement. “I hadn’t heard from the Dolphins during this entire process, but I’m excited that I heard from them today.”                                 ", "sentiment": 0.1071271929824561, "subjectivity": 0.4462719298245615, "wordcount": 362}
{"url": "https://baltimore.cbslocal.com/2020/04/25/coronavirus-and-schools-maryland-educators-students-aim-to-adapt-to-closures/", "fetchtime": "2020-04-26T03:49:18+00:00", "keywords": ["coronavirus", " covid-19", " coronavirus and schools"], "language": "en-US", "firstpubtime": "2020-04-25T16:23:05+00:00", "modtime": "2020-04-25T16:23:05+00:00", "headline": "Coronavirus And Schools: Maryland Educators, Students Aim To Adapt To Closures", "bylines": ["CBS Baltimore"], "source": "CBS Baltimore", "summary": "Learning has changed in Maryland since the coronavirus outbreak. Teachers and students have been forced to turn to online platforms across all education levels due to the closing of classrooms.", "originalurl": "https://baltimore.cbslocal.com/2020/04/25/coronavirus-and-schools-maryland-educators-students-aim-to-adapt-to-closures/", "previousfetches": 0, "bodytext": "ELLICOTT CITY, Md. (Capital News Service) —  Learning has changed in Maryland since the coronavirus outbreak. Teachers and students have been forced to turn to online platforms across all education levels due to the closing of classrooms.   Last week, the Maryland State Department of Education extended its closure of public school systems through at least May 15.   “This is the right decision for the safety and health of our students, educators, and state,” Maryland State Education Association President Cheryl Bost said, pointing to challenges such as technology access and food insecurity that hamper distance education for some students. “This type of learning is no substitute for in-person learning, and we will need to be thoughtful and serious about how we help students recover from this crisis.”   Higher-education institutions within the University System of Maryland and around the state had already moved to online-only at least for the rest of the spring semester.   “What we had to do was really set expectations,” Montgomery County Public Schools spokesman Derek Turner told Capital News Service. “First we need to focus on student health and wellness, and then we need to focus on what a new world of instruction looks like.”   K-12 education faces some of the toughest challenges. There is a wide array of ages and behaviors among students, and varying access to online platforms, according to Turner.   Montgomery County schools have loaned out more than 43,000 Chromebook laptops to students in order to give them access to the online learning environments, according to Turner.   “The biggest problem we’re facing is internet connectivity,” Turner said. “We’re constantly looking for opportunities to make sure we are closing gaps in the digital divide.”   Montgomery County Public Schools has been working with Comcast to allow students to access the internet and has been purchasing hotspot devices for those who lack local connections. Lockheed Martin donated $25,000 to the school system toward the purchase of more mobile hotspots, according to Turner.   Keeping to a schedule can also be a challenge — for teachers and students.   Anne Arundel County Public Schools, for example, published a suggested daily calendar for students. Each calendar — for elementary, middle and high school levels — gave guidance as to how students could tackle their days at home in the online environment.   “The notion is that we wanted to build a structure for students that was flexible and provided structure and support for them,” Anne Arundel schools spokesman Bob Mosier said.   Colleges and universities across the state took recommendations from the University System of Maryland, which on March 10 announced they were shutting down campuses and moving classes online. This policy has stayed in place for the remainder of the semester.   Many have attempted to ease pressure on students by implementing campus-wide changes to grading policies. The University of Maryland, College Park implemented a pass/fail system, Towson University implemented its Pass Grading Option and Salisbury University opted for a pass/no pass system.   “Working in concert with some of the other University System of Maryland schools, it was determined that, for this semester only, that it would be a good option for some of our students” who have been disrupted by having to take classes online and/or the virus affecting their personal lives, Salisbury University spokesman Jason Rhodes said.   “We know this is a stressful time for a lot of students, as well as faculty and staff, and we’re always looking to do the right thing for our university community,” Rhodes said.   Rhodes also mentioned that Salisbury, and likely other University System of Maryland campuses, had a pandemic plan in place that was drafted when the avian flu and swine flu presented threats in 2008 and 2009, respectively, so the transition was not unforeseen.   “This is the first time that we’ve had to put that (plan) into action,” Rhodes said. “And certainly once this is all over, there’ll be a debrief about what can be done different, what can be done better, next time. But this is something that we prepared for and we’re certainly happy that we did.”                                 ", "sentiment": 0.1072315689361144, "subjectivity": 0.38954955398137214, "wordcount": 675}
{"url": "https://baltimore.cbslocal.com/2020/04/25/coronavirus-response-more-than-38k-new-unemployment-claims-filed-using-marylands-new-website/", "fetchtime": "2020-04-26T03:49:18+00:00", "keywords": ["coronavirus", " covid-19", " coronavirus response", " unemployment"], "language": "en-US", "firstpubtime": "2020-04-25T22:35:53+00:00", "modtime": "2020-04-25T22:35:53+00:00", "headline": "Coronavirus Response: More Than 38K New Unemployment Claims Filed Using Maryland’s New Website", "bylines": ["CBS Baltimore"], "source": "CBS Baltimore", "summary": "More than 38,000 new unemployment claims have been successfully filed using Maryland's new one-stop online application, Gov. Larry Hogan's office said Saturday.", "originalurl": "https://baltimore.cbslocal.com/2020/04/25/coronavirus-response-more-than-38k-new-unemployment-claims-filed-using-marylands-new-website/", "previousfetches": 0, "bodytext": "  ANNAPOLIS, Md. (WJZ) —  More than 38,000 new unemployment claims have been successfully filed using Maryland’s new one-stop online application, Gov. Larry Hogan’s office said Saturday.  As of 9 a.m. Saturday, more than 67,000 new accounts were created and more than 220,000 users accessed the system, Hogan’s communications director Mike Ricci tweeted.   On Friday evening, officials reported 19,000 claims had been filed in a little more than 10 hours.     Update on  @MD_Labor  unemployment website, as of 9:00 am: -67,000+ accounts have been activated. -38,000+ new claims have been filed successfully.  -Over 220,000 unique users have accessed the system.   — Mike Ricci (@riccimike)  April 25, 2020     READ MORE: New One-Stop Maryland Unemployment Site Launches; Issues Mostly Fixed, Hogan Says   The BEACON One-Stop application launched at 7 a.m. Friday but saw multiple issues due to the volume of people trying to log on. Hogan said by Friday afternoon the majority of the issues had been resolved but some glitches remained.   UNEMPLOYMENT RESOURCES:     Coronavirus Resources: Maryland To Launch New ‘One-Stop’ Unemployment Benefits Website On April 24   How To File For Unemployment In Maryland   Here’s A New Email To Get Your Unemployment Questions Answered In Maryland   Coronavirus Pandemic Leave You Unemployed? Here’s How Marylanders Can Get Help   Pratt Library Offering Online Job Search Help, Tutoring While Buildings Remain Closed   While Some Businesses Are Closing, Others Need More Workers   Amazon, Walmart Among Companies Hiring Temporary Workers Amid COVID-19 Pandemic   Looking For A Job? Here Are Some Baltimore Businesses Hiring Amid COVID-19 Pandemic     To access the new BEACON One-Stop, visit  https://beacon.labor.maryland.gov/claimant/   For the latest information on coronavirus go to the  Maryland Health Department’s website  or call 211. You can find all of WJZ’s coverage on  coronavirus in Maryland here .                                 ", "sentiment": 0.26753952569169964, "subjectivity": 0.5048418972332016, "wordcount": 284}
{"url": "https://baltimore.cbslocal.com/2020/04/25/viviano-ravens-2020-nfl-draft-class-packed-with-potential/", "fetchtime": "2020-04-26T03:49:18+00:00", "keywords": ["nfl draft", " nfl", " draft", " 2020 nfl draft", " ravens", " baltimore ravens"], "language": "en-US", "firstpubtime": "2020-04-25T22:43:18+00:00", "modtime": "2020-04-25T22:43:18+00:00", "headline": "Viviano: Ravens’ 2020 NFL Draft Class ‘Packed With Potential’", "bylines": ["Mark Viviano"], "source": "CBS Baltimore", "summary": "The Baltimore Ravens entered the three-day draft with eight picks but ended up bringing home ten players after some wheeling and dealing.", "originalurl": "https://baltimore.cbslocal.com/2020/04/25/viviano-ravens-2020-nfl-draft-class-packed-with-potential/", "previousfetches": 0, "bodytext": "  BALTIMORE (WJZ) —  The 2020 NFL Draft has come and gone, and despite changing formats due to the coronavirus pandemic, hundreds of future NFL players now know their fates.  The Baltimore Ravens entered the three-day draft with eight picks but ended up bringing home ten players after some wheeling and dealing.   Before the draft, General Manager Eric DeCosta said he likes to have a lot of picks. The team ended up dividing those picks equally between offense and defense.   The Ravens’ biggest needs going into the draft were at linebacker, offensive line and wide receiver. Having ten picks allowed them to grab two players at each of those positions. The wide receivers will help quarterback Lamar Jackson diversify the passing game.   The team also added two players to the defensive line, bringing some youth to that group after signing a pair of veteran free agent defensive lineman in Calais Campbell and Derek Wolfe.   The Ravens will also sign a number of undrafted players and they have a long history of having someone from that group make the team.   Overall, it’s a class “packed with potential,” WJZ’s Mark Viviano said.   COMPLETE 2020 NFL DRAFT COVERAGE:     NFL Draft: Ravens Pick Up S Geno Stone In 7th Round, WR James Proche In 6th Round   NFL Draft: Ravens Bolster Defensive Line, Take Broderick Washington Jr. In Fifth Round   NFL Draft: Ravens Take Offensive Guard Ben Bredeson In Fourth Round Of Draft   NFL Draft: Ravens 3rd Round Picks Include Justin Madubuike, Devin Duvernary, Malik Harrison, Tyre Phillips   NFL Draft: Ravens Pick Up J.K. Dobbins In Second Round Of 2020 Draft   Ravens Could Target Interior Offensive Lineman In Coming Rounds Of Draft   Ravens First Round Pick Patrick Queen Ready For ‘A Lot Of Wins’ In Rookie Season   Lamar Jackson Calls Ravens 1st Round Pick Patrick Queen ‘Ray Lewis Jr.’   Ravens Take LB Patrick Queen With 28th Overall Pick In 2020 NFL Draft   Baltimore Ravens To Raise Money For The Salvation Army During NFL Draft   ‘We Love To Make Trades’ | Ravens General Manager Eric DeCosta Previews NFL Draft   Former Towson University QB Tom Flacco Hopes To Hear His Name Called At The NFL Draft   Interior Offensive Line And Inside Linebacker Are Ravens Clear Needs In NFL Draft Says WJZ’s Mark Viviano   Read More NFL News From CBSSports.com     Here’s who the Ravens chose:     Patrick Queen : linebacker, Louisiana State University (Round One, 28th overall pick)     TUSCALOOSA, ALABAMA – NOVEMBER 09: Patrick Queen #8 of the LSU Tigers celebrates after intercepting a pass during the second quarter against the Alabama Crimson Tide in the game at Bryant-Denny Stadium on November 09, 2019 in Tuscaloosa, Alabama. (Photo by Kevin C. Cox/Getty Images)   The Ravens had never before picked a player from the powerhouse Louisiana State University football program. Patrick Queen changed that.   It all went according to plan for the Ravens: Queen was the guy they wanted and the guy they needed. He fills a need at inside linebacker.   Queen was the defensive MVP in the National Championship game, and it looked like he’d stay in Louisiana and get drafted by the New Orleans Saints. The Saints passed, though, and the Ravens got their man.   Queen said he doesn’t mind leaving home to start his NFL career in Baltimore.     J.K. Dobbins : running back, Ohio State University (Round Two, 55th overall pick)     GLENDALE, ARIZONA – DECEMBER 28: Running back J.K. Dobbins #2 of the Ohio State Buckeyes rushes the football against the Clemson Tigers during the PlayStation Fiesta Bowl at State Farm Stadium on December 28, 2019 in Glendale, Arizona. The Tigers defeated the Buckeyes 29-23. (Photo by Christian Petersen/Getty Images)   With the emphasis on defense in the first round, the Ravens went for offense in the second round, picking up another big-time player from another big-time football school.   At Ohio State, Dobbins set a Buckeyes record with more than 2,000 rushing yards this past season, scoring 21 touchdowns.   One of the top running backs in college football now joins a Ravens offense that set the record for most rushing yards in a season, teaming up with quarterback Lamar Jackson and running backs Mark Ingram, Gus Edwards and Justice Hill.     Justin Madubuike : defensive tackle, Texas A&M University (Round Three, 71st overall pick)     ARLINGTON, TEXAS – SEPTEMBER 28: Justin Madubuike #52 of the Texas A&M Aggies during the Southwest Classic at AT&T Stadium on September 28, 2019 in Arlington, Texas. (Photo by Ronald Martinez/Getty Images)   It was back to defense for the Ravens’ first pick of the third round, taking big defensive tackle Justin Madubuike.   Madubuike was very emotional when he found out the Ravens picked him and said he had a feeling Baltimore would call.   At six-foot-three and 300 pounds, Madubuike is very mobile. That helped him earn second-team All-SEC this past season.   Madubuike comes to a Ravens franchise with a rich history on defense.     Devin Duvernay: wide receiver, University of Texas (Round Three, 92nd overall pick)   Malik Harrison: linebacker, Ohio State University (Round Three, 98th overall pick)   Tyre Phillips: offensive tackle, Mississippi State University (Round Three, 106th overall pick)   Ben Bredeson : offensive guard, University of Michigan (Round Four, 143rd overall pick)     ANN ARBOR, MICHIGAN – NOVEMBER 17: Ben Bredeson #74 of the Michigan Wolverines leaves the field after a 31-20 win over the Indiana Hoosiers at Michigan Stadium on November 17, 2018 in Ann Arbor, Michigan. (Photo by Gregory Shamus/Getty Images)   Bredeson is a big-time interior blocker who can play guard or center. He was a team captain at Michigan where he played for Head Coach Jim Harbaugh, the brother of Ravens Head Coach John Harbaugh.   Bredeson is the mix in the Ravens’ search to fill the vacancy left by Marshal Yanda.     Broderick Washington, Jr. : defensive tackle (Round Five, 170th overall pick)     LUBBOCK, TEXAS – OCTOBER 05: Defensive tackle Broderick Washington Jr #96 of the Texas Tech Red Raiders holds up the ball after recovering a fumble during the first half of the college football game between the Texas Tech Red Raiders and the Oklahoma State Cowboys on October 05, 2019 at Jones AT&T Stadium in Lubbock, Texas. (Photo by John E. Moore III/Getty Images)   Washington was the second defensive lineman the Ravens picked up in the draft and the fourth the team picked up this off-season after they picked up veterans Calais Campbell and Derrick Wolfe.     James Proche: wide receiver, Southern Methodist University (Round Six, 201st overall pick)     DALLAS, TEXAS – NOVEMBER 09: James Proche #3 of the Southern Methodist Mustangs is tackled by Ja’Quan McMillian #21 of the East Carolina Pirates in the first half at Gerald J. Ford Stadium on November 09, 2019 in Dallas, Texas. (Photo by Ronald Martinez/Getty Images)   Proche is a four-year starter who has had elite-level production with more than 1,000 receiving yards and double digits in touchdown catches in both of the past two seasons. He’s also a punt returner.     Geno Stone : safety, University of Iowa (Round Seven, 219th overall pick)     Stay with WJZ for more on the 2020 NFL Draft.                                 ", "sentiment": 0.0006969696969697009, "subjectivity": 0.2649954545454544, "wordcount": 1165}
{"url": "https://baltimore.cbslocal.com/2020/04/25/coronavirus-tourism-maryland-online-activities/", "fetchtime": "2020-04-26T03:49:18+00:00", "keywords": ["maryland office of tourism", " covid-19", " coronavirus", " maryland news", " health", ""], "language": "en-US", "firstpubtime": "2020-04-25T22:40:02+00:00", "modtime": "2020-04-25T22:40:02+00:00", "headline": "Coronavirus Latest: Maryland Tourism Officials Offer Online Activities To Inspire Future Travel", "bylines": ["Sean Streicher"], "source": "CBS Baltimore", "summary": "The Maryland Office of Tourism is looking to give families something to do at home during the COVID-19 pandemic.", "originalurl": "https://baltimore.cbslocal.com/2020/04/25/coronavirus-tourism-maryland-online-activities/", "previousfetches": 0, "bodytext": "  BALTIMORE (WJZ) —  The Maryland Office of Tourism is looking to give families something to do at home during the COVID-19 pandemic while inspiring their future travel plans in the state.  While tourism has been hit hard by the coronavirus pandemic, the agency has found a way for people to explore the state without leaving home.   A trip to the National Aquarium may be off the table, but the Engel family recently spent time visiting virtually.   CORONAVIRUS COVERAGE:     Coronavirus Resources: How To Get Help In Maryland   What We Know About Coronavirus In Maryland   Latest coronavirus stories from WJZ     “That’s one we like to go to in person, so it was fun to still be able to see the tanks and everything,” Leticia Engel said.   It’s just one of nearly 50 games and virtual experiences the Maryland Office of Tourism made accessible on its web site in the hope of inspiring future travel in the state.   “I’m sure they’re tired of playing Monopoly a several thousand times, so this is something to bond families together and give them something to do that’s close to home,” Matthew Scales said.   “I followed the Visit Maryland social media, so that’s where I saw they were coming up with these fun ideas,” Engel said.   The activities range from taking a 3D tour of a lighthouse playing a game of This or That — Maryland style.   On top of giving them something to do, it gives them something to look forward to.   “What I actually like was the Maryland bingo,” Engel said. “It was a fun way to reminisce about some of the stuff that we’ve done but, we’ve also been able to create a bucket list of stuff we want to do once we can.”   All the activities are free. To learn more,  visit the Maryland Office of Tourism’s website .   For the latest information on coronavirus go to the  Maryland Health Department’s website  or call 211. You can find all of WJZ’s coverage on  coronavirus in Maryland here .                                 ", "sentiment": 0.21319444444444444, "subjectivity": 0.46967592592592594, "wordcount": 335}
{"url": "https://baltimore.cbslocal.com/2020/04/25/celebrity-chef-jose-andres-distributes-25k-meals-to-those-in-need-during-coronavirus-pandemic/", "fetchtime": "2020-04-26T03:49:18+00:00", "keywords": ["josé andrés", " mayor jack young", " oriole park", " coronavirus", " maryland news", " health", " covid-19", " world central kitchen", ""], "language": "en-US", "firstpubtime": "2020-04-25T22:39:48+00:00", "modtime": "2020-04-25T22:39:48+00:00", "headline": "Celebrity Chef José Andrés Distributes 25K Meals To Those In Need During Coronavirus Pandemic", "bylines": ["CBS Baltimore"], "source": "CBS Baltimore", "summary": "Celebrity chef José Andrés and his charity, World Central Kitchen, along with the help of Mayor Jack Young and volunteers, were at Oriole Park Saturday to distribute 25,000 meals to those in need as the coronavirus pandemic continues.", "originalurl": "https://baltimore.cbslocal.com/2020/04/25/celebrity-chef-jose-andres-distributes-25k-meals-to-those-in-need-during-coronavirus-pandemic/", "previousfetches": 0, "bodytext": "  BALTIMORE (WJZ) —  Celebrity chef José Andrés and his charity, World Central Kitchen, along with the help of Mayor Jack Young and volunteers, were at Oriole Park Saturday to distribute 25,000 meals to those in need as the coronavirus pandemic continues.  Andrés said that he and his team will be back at Oriole Park every Saturday and at area schools on Wednesdays and Fridays.   CORONAVIRUS COVERAGE:     Coronavirus Resources: How To Get Help In Maryland   What We Know About Coronavirus In Maryland   Latest coronavirus stories from WJZ       Hello People of America! Today we  @WCKitchen  are in Baltimore at  @Orioles  stadium distributing 25,000 meals! Thank you  @mayorbcyoung  & your amazing team…We will be back here every Saturday…and at schools Weds&Fri!  #ChefsForAmerica   pic.twitter.com/4QyTniYw1x   — José Andrés (@chefjoseandres)  April 25, 2020         The charity is working in partnership with Revolution Foods and local schools like Fort Worthington Elementary/Middle School to distribute meals twice a week.   The celebrity chef said he hopes the effort will show that restaurants are essential and food shouldn’t be wasted.   “This is for us a way to show the federal government, as it is going to keep going, how the restaurants can be part of the solution,” Andrés said.   World Central Kitchen said they’re here to stay.   For the latest information on coronavirus go to the  Maryland Health Department’s website  or call 211. You can find all of WJZ’s coverage on  coronavirus in Maryland here .                                 ", "sentiment": 0.1619318181818182, "subjectivity": 0.35454545454545455, "wordcount": 235}
{"url": "https://baltimore.cbslocal.com/2020/04/25/nfl-draft-ravens-pick-up-s-geno-stone-in-7th-round-wr-james-proche-in-6th-round/", "fetchtime": "2020-04-26T03:49:18+00:00", "keywords": ["nfl draft", " draft", " nfl", " james proche", " geno stone"], "language": "en-US", "firstpubtime": "2020-04-25T17:43:08+00:00", "modtime": "2020-04-25T17:43:08+00:00", "headline": "NFL Draft: Ravens Pick Up S Geno Stone In 7th Round, WR James Proche In 6th Round", "bylines": ["CBS Baltimore"], "source": "CBS Baltimore", "summary": "Wide receiver James Proche and safety Geno Stone round out the Baltimore Ravens' draft picks on the third day of the 2020 NFL Draft.", "originalurl": "https://baltimore.cbslocal.com/2020/04/25/nfl-draft-ravens-pick-up-s-geno-stone-in-7th-round-wr-james-proche-in-6th-round/", "previousfetches": 0, "bodytext": "  BALTIMORE (WJZ) —  Wide receiver James Proche and safety Geno Stone round out the Baltimore Ravens’ draft picks on the third day of the 2020 NFL Draft.  Proche, a five-foot-eleven, 201-pound wide receiver from Southern Methodist University, was the 201st overall pick. The Ravens scooped him up during the sixth round of the draft on Saturday.   He started all 13 games in the 2019 season and was ranked second nationally in receptions per game.     Welcome to Baltimore,  @jamesproche3  ❗️❗️  pic.twitter.com/uN3pqvz0Wl   — Baltimore Ravens (@Ravens)  April 25, 2020     Stone, meanwhile, is a five-foot-eleven, 207-pound safety from Iowa who the Ravens picked up in the seventh round. He was the 219th overall pick.   Stone started all 13 games in the 2019 season at strong safety and was named second-team All-Big Ten by coaches and the AP.     Welcome to Baltimore,  @GenoStone22  ❗️❗️  pic.twitter.com/dutFt9BI5Z   — Baltimore Ravens (@Ravens)  April 25, 2020     MORE NFL DRAFT COVERAGE:     NFL Draft: Ravens Bolster Defensive Line, Take Broderick Washington Jr. In Fifth Round   NFL Draft: Ravens Take Offensive Guard Ben Bredeson In Fourth Round Of Draft   NFL Draft: Ravens 3rd Round Picks Include Justin Madubuike, Devin Duvernary, Malik Harrison, Tyre Phillips   NFL Draft: Ravens Pick Up J.K. Dobbins In Second Round Of 2020 Draft   Ravens Could Target Interior Offensive Lineman In Coming Rounds Of Draft   Ravens First Round Pick Patrick Queen Ready For ‘A Lot Of Wins’ In Rookie Season   Lamar Jackson Calls Ravens 1st Round Pick Patrick Queen ‘Ray Lewis Jr.’   Ravens Take LB Patrick Queen With 28th Overall Pick In 2020 NFL Draft   Baltimore Ravens To Raise Money For The Salvation Army During NFL Draft   ‘We Love To Make Trades’ | Ravens General Manager Eric DeCosta Previews NFL Draft   Former Towson University QB Tom Flacco Hopes To Hear His Name Called At The NFL Draft   Interior Offensive Line And Inside Linebacker Are Ravens Clear Needs In NFL Draft Says WJZ’s Mark Viviano   Read More NFL News From CBSSports.com       #Ravens  third day  #NFLDraft2020  recap  4th- OG Ben Bredeson (Mich) 5th- DT  Broderick Washington (Texas Tech) 6th-WR James Proche (SMU) 7th- S- Geno Stone (Iowa)   #WJZ   — Mitch Friedmann (@mafriedtv)  April 25, 2020     Stay with WJZ for the latest on the 2020 NFL Draft.                                 ", "sentiment": 0.07037037037037039, "subjectivity": 0.32638888888888895, "wordcount": 365}
{"url": "https://baltimore.cbslocal.com/2020/04/25/ravens-bolster-defensive-line-take-broderick-washington-jr-in-fifth-round/", "fetchtime": "2020-04-26T03:49:18+00:00", "keywords": ["nfl", " baltimore ravens", " broderick washington", " nfl draft", " 2020 nfl draft", ""], "language": "en-US", "firstpubtime": "2020-04-25T15:33:05+00:00", "modtime": "2020-04-25T15:33:05+00:00", "headline": "NFL Draft: Ravens Bolster Defensive Line, Take Broderick Washington Jr. In Fifth Round", "bylines": ["CBS Baltimore"], "source": "CBS Baltimore", "summary": "The Ravens added depth to their already talented defensive line in the fifth round of this year's draft.", "originalurl": "https://baltimore.cbslocal.com/2020/04/25/ravens-bolster-defensive-line-take-broderick-washington-jr-in-fifth-round/", "previousfetches": 0, "bodytext": "  BALTIMORE (WJZ) —  The Ravens added depth to their already talented defensive line in the fifth round of this year’s draft.  Baltimore took defensive tackle Broderick Washington Jr. out of Texas Tech with the 170th overall pick.   The Longview, Texas, native stands at 6’3″ and 305 lbs.   MORE NFL DRAFT COVERAGE:     NFL Draft: Ravens Pick Up S Geno Stone In 7th Round, WR James Proche In 6th Round   NFL Draft: Ravens Take Offensive Guard Ben Bredeson In Fourth Round Of Draft   NFL Draft: Ravens 3rd Round Picks Include Justin Madubuike, Devin Duvernary, Malik Harrison, Tyre Phillips   NFL Draft: Ravens Pick Up J.K. Dobbins In Second Round Of 2020 Draft   Ravens Could Target Interior Offensive Lineman In Coming Rounds Of Draft   Ravens First Round Pick Patrick Queen Ready For ‘A Lot Of Wins’ In Rookie Season   Lamar Jackson Calls Ravens 1st Round Pick Patrick Queen ‘Ray Lewis Jr.’   Ravens Take LB Patrick Queen With 28th Overall Pick In 2020 NFL Draft   Baltimore Ravens To Raise Money For The Salvation Army During NFL Draft   ‘We Love To Make Trades’ | Ravens General Manager Eric DeCosta Previews NFL Draft   Former Towson University QB Tom Flacco Hopes To Hear His Name Called At The NFL Draft   Interior Offensive Line And Inside Linebacker Are Ravens Clear Needs In NFL Draft Says WJZ’s Mark Viviano   Read More NFL News From CBSSports.com     Washington appeared in every game for the Red Raiders throughout his four-year collegiate career. He became an anchor on the defensive line and was a starter in every game but that of his freshman year.     Welcome to Baltimore, Broderick Washington❗️❗️  pic.twitter.com/a1iqft2sSn   — Baltimore Ravens (@Ravens)  April 25, 2020         He concluded his time at Texas Tech with 38-career starts, all of which were consecutive since the 2016 season finale. Washington boasted the second-highest amount of career starts on the defense and third-most on the team.   Washington led all defensive linemen with 39 tackles — including 5.5 that went for a loss — posted 2.5 sacks to go along with seven quarterback hurries, a fumble recovery and two pass breakups.                                 ", "sentiment": 0.05555555555555555, "subjectivity": 0.3450617283950618, "wordcount": 343}
{"url": "https://baltimore.cbslocal.com/2020/04/25/stressed-pets-how-to-stop-it-now-and-when-you-go-back-to-work/", "fetchtime": "2020-04-26T03:49:18+00:00", "keywords": ["stress in pets", " stress", " work from home", " coronavirus", " covid-19"], "language": "en-US", "firstpubtime": "2020-04-25T21:29:25+00:00", "modtime": "2020-04-25T21:29:25+00:00", "headline": "Stressed Pets: How To Stop It Now And When You Go Back To Work", "bylines": ["CBS Baltimore"], "source": "CBS Baltimore", "summary": "For some pets used to more regular routines and serious alone time, the sudden reality of 24/7 intimacy could be nerve-racking, even catastrophic, especially if there are small children in the home.", "originalurl": "https://baltimore.cbslocal.com/2020/04/25/stressed-pets-how-to-stop-it-now-and-when-you-go-back-to-work/", "previousfetches": 0, "bodytext": "  (CNN) —  Happy dogs chasing balls on their fourth walk of the day. Purring puffs of fluff who can’t wait to snuggle with pet parents miraculously home all day. These are the images we may have of sheltering with our pets during the age of coronavirus.  For some pets, that may well be true. For others used to more regular routines and serious alone time, the sudden reality of 24/7 intimacy could be nerve-racking, even catastrophic, especially if there are small children in the home.   “It can be overwhelming for pets when kids are home all the time, especially infants and toddlers. which is why they should never be left alone with the pet, not even for 30 seconds,” said Dr. John Howe, the president of the  American Veterinary Medical Association .   “Even the nicest dog in the world can bite. In fact there are 4.5 million dog bites a year in America, and over 800,000 of them need medical attention,” Howe said. “Over half the bites are to children, and it’s usually a serious injury when it happens to a child.   “Dogs and cats really need a safe place where they feel comfortable, where they can go and not be bothered,” he said, “especially if there’s children in the house.”   We transfer our stress, too   To make matters worse, many of us humans   are incredibly stressed right now.   We’re worried about our health and that of our loved ones during the pandemic. We’re working long hours from home or fretting over the loss of a job. We’re going stir crazy from social isolation or tense from being with the same people without a break.   While we may think we’re handling all that well, our pets will recognize our tension and anxiety — and may make it their own.   “You might think you’re internalizing everything, but what we know from studies on both humans and animals is that we are not. There’s physical manifestations that are probably even more obvious to our dogs and cats than ourselves,” said Dr. Dana Varble, the chief veterinary officer for the North American Veterinary Community.   “Their emotions can be a reflection of ours because they are so tightly bonded with us,” said veterinarian Dr. Meredith Montgomery, a clinical assistant professor of shelter medicine at the University of Florida.   Montgomery, who specializes in decreasing stress for shelter dogs and cats, has seen it firsthand while isolating with four medically rescued cats and a dog.   Her cats have not reacted well to the constant din and boundless energy of her two-year-old toddler, who’s now home instead of at day care most of the day.   “None of my cats particularly enjoy each other. So what’s been very important for us in keeping a peaceful household is that they all have their own space within the home,” Montgomery said.   She’s done that by using baby gates to provide some respite and encourages “vertical space within the home and giving each cat access to established areas, like boxes, where they can hide.”   How to tell if your pet is stressed   Realize that there aren’t specific signs that will apply to every dog or cat, experts said.   “Just like us, every dog or cat is an individual,” Montgomery said. “So not only are different things going to stress them, but they also might have different and unique thresholds for stress.”   Stressed dogs can startle, jumping at the slightest sound or movement. Some shake and shiver, vocalize excessively or drool. They can use self-calming techniques, such as yawning, lip licking, excessive grooming or spinning.   Oddly, tense and upset dogs can also look depressed, showing a lack of appetite or energy. At times they can get diarrhea or urinate or defecate more often. And, of course, dogs can become uncharacteristically aggressive, snapping or growling.   Cats, on the other hand, are more difficult to read, said experts. You have to look for more subtle signs, such as overgrooming, increased vocalization, lack of appetite, hiding or acting standoffish and, of course, suddenly ignoring their litter box.   “Cats will usually give you some little hint and if you ignore it, that’s when they start to poop on the bed, pee on the couch, go outside the litter box,” Howe said.   While you should always check with your vet to make sure there’s no urinary infection, stress itself can cause significant problems, he said.   “In fact, sometimes cats get a hemorrhagic cystitis where they start peeing blood, and it’s just from stress, not from infection,” Howe said.   Help your dog and cat calm down   It’s all about routine.  For both species, the main solution is to stick to a regular regimen, just as you would do with a young child, experts said.   “They love to have the same routine,” Howe said. “Getting up at the same time, eating at the same time, playing at the same time. That’s the key.”   Use pet gates and crates.  If a dog is crate trained, it can be very soothing for them to go back to their own special place, Howe said.   “They’re safe, they’re comfortable, and it’s an opportunity for them to practice independence in their own space,” he said. The use of baby and pet gates or barriers can also help keep pets and children separated, he added.   “Gates are so good to have while you’re doing something like cooking, when you can’t give the kids or dog direct supervision,” Howe said.   Play species-specific music. It’s actually true that music does soothe the savage soul.   “Something that I use in the shelters and high-volume spay-neuter facilities that I’ve worked in is playing music,” Montgomery said. “I have used slow-paced classical music at a low volume for ‘quiet hour’ with shelter dogs.”   She said that allows them time for decompression with a food puzzle or “treat-filled Kong, providing a healthy, appropriate chewing outlet.”   There are even species-specific tunes. A  study published in 2015  found that cats preferred such feline-favorite sounds such as chirping, purring and the sucking sound of nursing kittens, mixed in with some classical music strains. You and your cat can listen  here , while Spotify and other websites provide  playlists  for dogs.   Keep grooming and playing.  Dogs need regular exercise and playtime with their owners, experts said. If you’re suddenly sitting on your couch all day instead, you’ll soon see the signs of distress in your pet.   Cats, too, need daily play that mimics what they would do in the wild. Playing with toys such as feather spinners and puzzles that contain treats can energize cats and keep them happy.   “Play with them, stimulate their hunting instincts, then feed them,” Howe suggested. After all, big cats in the wild rest after a good hunt and a full tummy.   Hopefully, grooming is part of your regular routine as good health care for your dog or cat. When it comes to calming, if your cat likes to be brushed, that’s often a winner.   “Grooming is very soothing to most cats,” Howe said.   Check your litter box etiquette.  Most cat owners already know they need to keep the litter boxes sparkling clean by scooping often. Cat are also very sensitive to the type of litter (most like sandy or clay-based) and scent (they prefer no scent). The litter box should be big enough for the cat to turn around in — bigger is better — and there should be a litter box on every level of your home. And if you have multiple cats?   “If you have two cats, you have three litter boxes spaced throughout the house, if you have three cats, add another,” Montgomery said.   The rule is to always have one more litter box than the total number of cats in the home. It’s also a good idea not to have a covering on a litter box, especially in multi-cat households, as cats feel most vulnerable while urinating or defecating, experts said.   Use positive, not negative reinforcement.  Having a dog rip up clothing or paper or your cat starting to scratch the couch or either species offering a sudden “gift” of pee or poop may seem like a personal affront, but experts said you should never take it personally.   “Dogs, and potentially cats, may be experiencing severe anxiety, which results in these fear-based or anxiety-based behaviors,” Montgomery said. “But it’s not some form of retribution against the owners. It’s because they’re experiencing a really heightened emotional state.”   Positive reinforcement, such as providing treats when the cat does go in the litter box or the dog poops outside, is the best way to solve behavior problems, experts said.   “Unfortunately one of the harder things to do is to ignore bad behavior,” Varble said. “But say your dog is bugging you, constantly nudging you. If they give up and they go away to their bed, it’s really important at that moment to go over to your dog and say, ‘Oh, good dog sitting on your bed. Do the petting there, reinforce that.”   Keep trying .  If problems continue, veterinarians want you to reach out, as they are quite used to helping owners with such behaviors. Vets may suggest pheromone diffusers   — made for both dogs and cats — that you can put in the home to promote relaxation and calm nerves. Your vet may prescribe   additional anxiety medications, or your vet may suggest a consultation with a behavioral specialist.   “The American College of Veterinary Behaviorists, ACVB, has a  great website  to find a veterinary behavioral expert that can do a consult with you,” Varble said. “And some of those behaviorists are already set up to do via the phone or video.”   Getting your pet ready for your return to work   Again, routine is king. “Try and maintain some sort of typical work schedule as best you can right now,” said Varble. “The more that we stick to typical work schedule and routine, the better our pets are going to adapt when we go back to work.”   That includes feeding, exercising, playing and grooming at about the same times each day, experts said. But if you’ve fallen off schedule while sheltering (and who hasn’t), don’t fret.   “If you know you’re going to go back to work in 10 days or so, start getting yourself and your animal on a more typical schedule,” Montgomery said. “Focus on doing things that you have been doing, like taking them for a short walk, and make sure you’re still fitting in those activities after your return to work.”   Consider crate training:  If you haven’t taught your dog how to stay in a crate, that might be a good choice now, experts said.   “Now while you’re still home, get your dog used to being in the crate,” Howe said. “You can still walk by and talk to your dog, but getting them used to the crate if you can’t leave them loose is very important.”   Keep up the playtime.  Just because you’re not there in the house all day doesn’t mean you can’t have “quality time” with your pet, experts said.   “What may this look like? Ten to 30 minutes of play with a favorite wand toy, special brushing session (if liked by your pet), a walk with your leashed dog, or time spent with a favorite toy playing fetch or tug-of-war,” Montgomery said, adding that her older dog enjoys “getting one-on-one time for ear scratches with her favorite person.”   As for pets with high energy, finding them an appropriate outlet can be important, she said.   “Daytime, individual dog-walking services may be beneficial as people return to nonessential services,” Montgomery said. “Providing food-filled Kongs or feeding toys and puzzles for cats and dogs can also be a way to keep their minds happy and engaged while we are away at work.”   Reach out to your vet.  Veterinarians want pet owners to reach out for help, both during coronavirus and after.   “We have a lot of information for the pet-owning public created by veterinarians on our  website,  and they can also find  COVID-19-specific information  as well,” Howe said.   The-CNN-Wire™ & © 2020 Cable News Network, Inc., a WarnerMedia Company. All rights reserved.                                 ", "sentiment": 0.15986497214245898, "subjectivity": 0.4892488096545687, "wordcount": 2017}
{"url": "https://baltimore.cbslocal.com/2020/04/25/the-4-best-spots-to-score-chicken-wings-in-baltimore/", "fetchtime": "2020-04-26T03:49:18+00:00", "keywords": ["chicken wings", " wings", " restaurants", " baltimore", " hoodline"], "language": "en-US", "firstpubtime": "2020-04-25T17:31:58+00:00", "modtime": "2020-04-25T17:31:58+00:00", "headline": "The 4 Best Spots To Score Chicken Wings In Baltimore", "bylines": ["CBS Baltimore"], "source": "CBS Baltimore", "summary": "Need more chicken wings in your life?", "originalurl": "https://baltimore.cbslocal.com/2020/04/25/the-4-best-spots-to-score-chicken-wings-in-baltimore/", "previousfetches": 0, "bodytext": "  BALTIMORE ( Hoodline ) —  Need more chicken wings in your life?  Hoodline crunched the numbers to find the top chicken wing sources in Baltimore, using both Yelp data and our own secret sauce to produce a ranked list of the best spots to venture next time you’re on the hunt.   April is one of the top months of the year for consumer spending at restaurants across the Baltimore area, according to data on local business transactions from Womply, a software provider that also helps small businesses find free advertising online. Estimated daily customers at Baltimore-area restaurants rose to 53 per business in April of last year, second only to March with an average of 54, and 4% higher than the average for the rest of the year.     Hoodline offers data-driven analysis of local happenings and trends across cities. Links included in this article may earn Hoodline a commission on clicks and transactions.   1. The Local Fry   PHOTO: SELWYN H./ YELP   First on the list is  The Local Fry . Located at 711 W. 40th St., Suite 152 in Hampden, the traditional American and Korean spot, which offers chicken wings and more, is the highest-rated chicken wing spot in Baltimore, boasting 4.5 stars out of 401 reviews on Yelp.   2. Gypsy’s Truckstaurant   PHOTO: LATOSHA G./ YELP   Next up is Hampden’s  Gypsy’s Truckstaurant , situated at 3515 Clipper Mill Road, Suite B. With 4.5 stars out of 71 reviews on Yelp, the New American spot, which offers seafood and chicken wings, has proved to be a local favorite.   3. JAZZ+SOJU   PHOTO: FLO S./ YELP   Riverside’s  JAZZ+SOJU , located at 900 E. Fort Ave., Suite 105, is another top choice, with Yelpers giving the bar and Korean spot, which offers chicken wings and more, four stars out of 158 reviews.   4. Delia Foley’s   PHOTO: JOHN W./ YELP   Delia Foley’s , a pub that offers chicken wings and more in SBIC, is another go-to, with four stars out of 83 Yelp reviews. Head over to 1439 S. Charles St. to see for yourself.     This story was created automatically using local business data, then reviewed and augmented by an editor.  Click here  for more about what we’re doing. Got thoughts?  Go here  to share your feedback.                                 ", "sentiment": 0.06566731141199227, "subjectivity": 0.41924564796905217, "wordcount": 372}
